"""
Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами,
що випали випадковим чином і в певному діапазоні під час чергового тиражу. Наприклад, необхідно вгадати
шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати набір унікальних
випадкових чисел для таких лотерей.
Вона буде повертати випадковий набір чисел у межах заданих параметрів, причому всі випадкові числа в наборі 
повинні бути унікальні.

Вимоги до завдання:

Параметри функції:
min - мінімальне можливе число у наборі (не менше 1).
max - максимальне можливе число у наборі (не більше 1000).
quantity - кількість чисел, які потрібно вибрати (значення між min і max).
Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
Функція повертає список випадково вибраних, відсортованих чисел. Числа в наборі не повинні повторюватися.
Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.

Рекомендації для виконання:

Переконайтеся, що вхідні параметри відповідають заданим обмеженням.
Використовуйте модуль random для генерації випадкових чисел.
Використовуйте множину або інший механізм для забезпечення унікальності чисел.
Пам'ятайте, що функція get_numbers_ticket повертає відсортований список унікальних чисел.

Критерії оцінювання:

Валідність вхідних даних: функція повинна перевіряти коректність параметрів.
Унікальність результату: усі числа у видачі повинні бути унікальними.
Відповідність вимогам: результат має бути у вигляді відсортованого списку.
Читабельність коду: код має бути чистим і добре документованим
"""
import random

# припустимо що задані параметри тільки цілі числа, бо протилежне не зазначено, як і їх перевірка на це
# якшо ні можемо зробити перевірку та кинути виняток
# або нічо не робить і використать блок "try exept" в критичному місті з виводом попереджування користувачу
# і відповідно пустими списками як результат


def get_numbers_ticket(min, max, quantity):
    # перевірка що всі задані параметри лежать в заданих межах
    # перевірка враховує те що ніхто не задасть кілкість псолідовності більше ніж кількість можливих варіантів унікальних чисел
    if not (1 <= min and max <= 1000 and quantity <= (max - min + 1)):
        return []

    # для отримання питомої послідовності будемо додавати в множину випадкові числа поки її довжине не досягне quantity
    temp = set()
    while len(temp) < quantity:

        temp.add(random.randint(min, max))

    # перетворимо множину потрібної довжини в список і відсортуємо його
    result = list(temp)
    result.sort()

    # ще простіше можна зробити виборку використавши вибірку з послідовності згенерованою методом range()
    # result = random.sample(range(min, max + 1), k=quantity)
    return result


if __name__ == '__main__':

    lottery_numbers = get_numbers_ticket(1, 49, 6)
    print("Ваші лотерейні числа:", lottery_numbers)
